IDEA Open Model
TypeResultsClass Enumeration
Compatible with IDEA StatiCa Beta 20.0
 TypeResultsClass
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum TypeResultsClass
Public Enumeration TypeResultsClass
Members
Member name | Value | Description
ULSResultsClass | 0 |  ULSResultsClass
SLSResultsClass | 1 |  SLSResultsClass
ULSCheckClass | 2 |  ULSCheckClass
SLSFrequentCheckClass | 3 |  SLSFrequentCheckClass
SLSQuasiPermanentCheckClass | 4 |  SLSQuasiPermanentCheckClass
SLSCharacteristicsCheckClass | 5 |  SLSCharacteristicsCheckClass
SLSDeflectionResultsClass | 6 |  SLSDeflectionResultsClass
ULSAccidentalResultsClass | 7 |  ULSAccidentalResultsClass
FatigueResultsClass | 8 |  FatigueResultsClass
CheckClassFireResistance | 9 |  CheckClassFireResistance
CheckClassBridgeLoadRating | 10 |  CheckClassBridgeLoadRating
See Also
Reference
IdeaRS.OpenModel.Loading Namespace